renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx24u/r_s12ad_rx24u.c
    /* APPLY POWER TO PERIPHERAL */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    /* Interrupt_disable */
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, (void *)&ipl_value);
#endif

    /* S12AD module clock is enabled */
    if (0 == unit)
    {
        MSTP(S12AD) = 0;
    }
    else if (1 == unit)
    {
        MSTP(S12AD1) = 0;
    }
    else
    {
        MSTP(S12AD2) = 0;
    }

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    /* Interrupt enable */
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, (void *)&ipl_value);
#endif

    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);

    if (2 == unit)
    {
        /* A/D register address */
        p_regs2 = (aregs2_t *)&S12AD2;

        /* Initialize S12AD2 register */

        /* A/D Control Register initialize */
        p_regs2->ADCSR.WORD = 0;

        /* A/D Channel Select Register A0 initialize */
        p_regs2->ADANSA0.WORD = 0;

        /* A/D-Converted Value Addition/Average Function Select Register 0 initialize */
        p_regs2->ADADS0.WORD = 0;

        /* A/D-Converted Value Addition/Average Count Select Register initialize */
        p_regs2->ADADC.BYTE = 0;

        /* A/D Control Extended Register initialize */
        p_regs2->ADCER.WORD = 0;

        /* A/D Conversion Start Trigger Select Register initialize */
        p_regs2->ADSTRGR.WORD = 0;

        /* A/D Channel Select Register B0 initialize */
        p_regs2->ADANSB0.WORD = 0;

        /* A/D Disconnection Detection Control Register initialize */
        p_regs2->ADDISCR.BYTE = 0;

        /* A/D Group Scan Priority Control Register initialize */
        p_regs2->ADGSPCR.WORD = 0;

        /* A/D Channel Select Register C0 initialize */
        p_regs2->ADANSC0.WORD = 0;

        /* A/D Group C Trigger Select Register initialize */
        p_regs2->ADGCTRGR.BYTE = 0;

        /* A/D Sampling State Register initialize */
        p_regs2->ADSSTR0  = ADC_SST_CNT_DEFAULT;
        p_regs2->ADSSTR1  = ADC_SST_CNT_DEFAULT;
        p_regs2->ADSSTR2  = ADC_SST_CNT_DEFAULT;
        p_regs2->ADSSTR3  = ADC_SST_CNT_DEFAULT;
        p_regs2->ADSSTR4  = ADC_SST_CNT_DEFAULT;
        p_regs2->ADSSTR5  = ADC_SST_CNT_DEFAULT;
        p_regs2->ADSSTR6  = ADC_SST_CNT_DEFAULT;
        p_regs2->ADSSTR7  = ADC_SST_CNT_DEFAULT;
        p_regs2->ADSSTR8  = ADC_SST_CNT_DEFAULT;
        p_regs2->ADSSTR9  = ADC_SST_CNT_DEFAULT;
        p_regs2->ADSSTR10 = ADC_SST_CNT_DEFAULT;
        p_regs2->ADSSTR11 = ADC_SST_CNT_DEFAULT;
        p_regs2->ADSSTRO  = ADC_SST_CNT_DEFAULT;

        /* A/D Conversion Extended Input Control Register initialize */
        p_regs2->ADEXICR.WORD = 0;

        /* SET MODE RELATED REGISTER FIELDS */
        g_dcb[unit].mode = mode;
        if ((ADC_MODE_SS_MULTI_CH_GROUPED == mode)
        || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A == mode))
        {
            p_regs2->ADCSR.BIT.ADCS = ADC_ADCS_GROUP_SCAN;
        }
        else if ((ADC_MODE_SS_MULTI_CH_GROUPED_GROUPC == mode)
        || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A_GROUPC == mode))
        {
            p_regs2->ADCSR.BIT.ADCS = ADC_ADCS_GROUP_SCAN;
            p_regs2->ADGCTRGR.BIT.GRCE = 1;       // Use Group C
        }
        else
        {
            if ((ADC_MODE_CONT_ONE_CH == mode) || (ADC_MODE_CONT_MULTI_CH == mode))
            {
                p_regs2->ADCSR.BIT.ADCS = ADC_ADCS_CONT_SCAN;
            }

            /* other modes have ADCS=0 */
        }

        if ((ADC_MODE_SS_ONE_CH_DBLTRIG == mode)
        || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A == mode)
        || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A_GROUPC == mode))
        {
            p_regs2->ADCSR.BIT.DBLE = 1;         /* enable double trigger */
        }

        /* SET TRIGGER AND INTERRUPT PRIORITY REGISTER FIELDS */
        if (ADC_TRIG_SOFTWARE != p_cfg->trigger)
        {
            p_regs2->ADSTRGR.BIT.TRSA = p_cfg->trigger;
        }

        if (ADC_TRIG_ASYNC_ADTRG == p_cfg->trigger)
        {
            p_regs2->ADCSR.BIT.EXTRG = 1;        /* set ext trigger for async trigger */
        }

        if (ADC_ADCS_GROUP_SCAN == p_regs2->ADCSR.BIT.ADCS)
        {
            /* for Group B */
            p_regs2->ADSTRGR.BIT.TRSB = p_cfg->trigger_groupb;

            /* for Group C */
            p_regs2->ADGCTRGR.BIT.TRSC = p_cfg->trigger_groupc;

            /* for Group B */
            IPR(S12AD2,GBADI2) = p_cfg->priority_groupb;

            /* for Group C */
            IPR(S12AD2,GCADI2) = p_cfg->priority_groupc;
        }

        /* for Group A */
        IPR(S12AD2,S12ADI2) = p_cfg->priority;

        /* SET REGISTER FIELDS FOR REMAINING PARAMETERS */
        p_regs2->ADCER.BIT.ADRFMT = (ADC_ALIGN_LEFT == p_cfg->alignment) ? 1 : 0;
        p_regs2->ADCER.BIT.ACE = (ADC_CLEAR_AFTER_READ_ON == p_cfg->clearing) ? 1 : 0;

        p_regs2->ADADC.BYTE = p_cfg->add_cnt;
    }
    else
    {
        /* A/D register address */
        if (0 == unit)
        {
            p_regs = (aregs_t *)&S12AD;
        }
        else
        {
            p_regs = (aregs_t *)&S12AD1;
        }

        /* Initialize S12AD and S12AD1 register */

        /* A/D Control Register initialize */
        p_regs->ADCSR.WORD = 0;

        /* A/D Channel Select Register A0 initialize */
        p_regs->ADANSA0.WORD = 0;

        /* A/D Channel Select Register A1 initialize */
        p_regs->ADANSA1.WORD = 0;

        /* A/D-Converted Value Addition/Average Function Select Register 0 initialize */
        p_regs->ADADS0.WORD = 0;

        /* A/D-Converted Value Addition/Average Function Select Register 1 initialize */
        p_regs->ADADS1.WORD = 0;

        /* A/D-Converted Value Addition/Average Count Select Register initialize */
        p_regs->ADADC.BYTE = 0;

        /* A/D Control Extended Register initialize */
        p_regs->ADCER.WORD = 0;

        /* A/D Conversion Start Trigger Select Register initialize */
        p_regs->ADSTRGR.WORD = 0;

