renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx24u/r_s12ad_rx24u.c
        case ADC_CMD_CHECK_SCAN_DONE_GROUPC:
            if (0 == unit)
            {
                if (1 == IR(S12AD,GCADI))
                {
                    IR(S12AD,GCADI) = 0;
                }
                else
                {
                    err = ADC_ERR_SCAN_NOT_DONE;
                }
            }
            else if (1 == unit)
            {
                if (1 == IR(S12AD1,GCADI1))
                {
                    IR(S12AD1,GCADI1) = 0;
                }
                else
                {
                    err = ADC_ERR_SCAN_NOT_DONE;
                }
            }
            else
            {
                if (1 == IR(S12AD2,GCADI2))
                {
                    IR(S12AD2,GCADI2) = 0;
                }
                else
                {
                    err = ADC_ERR_SCAN_NOT_DONE;
                }
            }
            break;

        case ADC_CMD_ENABLE_INT:
            if (2 == unit)
            {
                p_regs2->ADCSR.BIT.ADIE = 1;           // enable S12ADI0 interrupt
            }
            else
            {
                p_regs->ADCSR.BIT.ADIE = 1;            // enable S12ADI0 interrupt
            }
            break;

        case ADC_CMD_DISABLE_INT:
            if (2 == unit)
            {
                p_regs2->ADCSR.BIT.ADIE = 0;           // disable S12ADI0 interrupt
            }
            else
            {
                p_regs->ADCSR.BIT.ADIE = 0;            // disable S12ADI0 interrupt
            }
            break;

        case ADC_CMD_ENABLE_INT_GROUPB:
            if (2 == unit)
            {
                p_regs2->ADCSR.BIT.GBADIE = 1;         // enable GBADI interrupt
            }
            else
            {
                p_regs->ADCSR.BIT.GBADIE = 1;          // enable GBADI interrupt
            }
            break;

        case ADC_CMD_DISABLE_INT_GROUPB:
            if (2 == unit)
            {
                p_regs2->ADCSR.BIT.GBADIE = 0;         // disable GBADI interrupt
            }
            else
            {
                p_regs->ADCSR.BIT.GBADIE = 0;          // disable GBADI interrupt
            }
            break;

        case ADC_CMD_ENABLE_INT_GROUPC:
            if (2 == unit)
            {
                p_regs2->ADGCTRGR.BIT.GCADIE = 1;      // enable GCADI interrupt
            }
            else
            {
                p_regs->ADGCTRGR.BIT.GCADIE = 1;       // enable GCADI interrupt
            }
            break;

        case ADC_CMD_DISABLE_INT_GROUPC:
            if (2 == unit)
            {
                p_regs2->ADGCTRGR.BIT.GCADIE = 0;      // disable GCADI interrupt
            }
            else
            {
                p_regs->ADGCTRGR.BIT.GCADIE = 0;       // disable GCADI interrupt
            }
            break;

        default:
            err = ADC_ERR_INVALID_ARG;
            break;
    }

    return err;
} /* End of function adc_control() */


/******************************************************************************
* Function Name: adc_configure_scan
* Description  : This function does extensive checking on channel mask
*                settings based upon operational mode. Mask registers are
*                initialized and interrupts enabled in peripheral. Interrupts
*                are also enabled in ICU if corresponding priority is not 0.
*
* Arguments    : p_config
*                    Pointer to channel config structure containing masks
* Return Value : ADC_SUCCESS-
*                    Successful
*                ADC_ERR_INVALID_ARG-
*                    reg_id contains an invalid value.
*                ADC_ERR_ILLEGAL_ARG-
*                    an argument is illegal based upon rest of configuration
*******************************************************************************/
static adc_err_t adc_configure_scan(uint8_t const   unit,
                                    adc_ch_cfg_t   *p_config)
{
    uint16_t    i=0;
    uint32_t    tmp_mask=0;

    aregs_t     *p_regs;
    aregs2_t     *p_regs2;
    uint16_t    trig_a;
    uint16_t    trig_b;
    uint16_t    trig_c;
    uint16_t    tmp_adpgacr;
    uint16_t    tmp_adpgags0;

    /* A/D register address */
    if (0 == unit)
    {
        p_regs = (aregs_t *)&S12AD;
    }
    else if (1 == unit)
    {
        p_regs = (aregs_t *)&S12AD1;
    }
    else
    {
        p_regs2 = (aregs2_t *)&S12AD2;
    }
#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
    adc_err_t   err;

    err = adc_check_scan_config(unit, p_config);
    if (ADC_SUCCESS != err)
    {
        return err;
    }

#endif /* parameter checking */

    if (2 == unit)
    {
        /* SET MASKS FOR CHANNELS */
        p_regs2->ADANSA0.WORD = (uint16_t) (p_config->chan_mask & 0x0FFF);

        /* SET MASKS FOR CHANNELS */
        p_regs2->ADANSB0.WORD = (uint16_t) (p_config->chan_mask_groupb & 0x0FFF);

        /* SET MASKS FOR CHANNELS */
        p_regs2->ADANSC0.WORD = (uint16_t) (p_config->chan_mask_groupc & 0x0FFF);

        /* SET MASKS FOR CHANNELS */
        p_regs2->ADADS0.WORD = (uint16_t) (p_config->add_mask & 0x0FFF);

        adc_configure_sensors(p_config);

        /* Operation stabilization wait time(5us) */
        R_BSP_SoftwareDelay((uint32_t)(5+1), BSP_DELAY_MICROSECS);

        /* SET GROUP A PRIORITY ACTION (not interrupt priority!) */

        if (ADC_GRPA_PRIORITY_OFF != p_config->priority_groupa)
        {
            trig_a = p_regs2->ADSTRGR.BIT.TRSA;              // save TRSA
            trig_b = p_regs2->ADSTRGR.BIT.TRSB;              // save TRSB
            trig_c = p_regs2->ADGCTRGR.BIT.TRSC;             // save TRSC
            p_regs2->ADSTRGR.BIT.TRSA = ADC_TRIG_NONE;
            p_regs2->ADSTRGR.BIT.TRSB = ADC_TRIG_NONE;
            p_regs2->ADGCTRGR.BIT.TRSC = ADC_TRIG_NONE;
            if (ADC_TRIG_NONE != p_regs2->ADSTRGR.BIT.TRSA)  // bus wait for ADSTRGR write
            {
                R_BSP_NOP();
            }
            if (ADC_TRIG_NONE != p_regs2->ADSTRGR.BIT.TRSB)  // bus wait for ADSTRGR write
            {
                R_BSP_NOP();
            }
            if (ADC_TRIG_NONE != p_regs2->ADGCTRGR.BIT.TRSC) // bus wait for ADGCTRGR write
            {
                R_BSP_NOP();
            }

            p_regs2->ADGSPCR.WORD = p_config->priority_groupa;

            p_regs2->ADSTRGR.BIT.TRSA = trig_a;              // restore TRSA

            if (0 == p_regs2->ADGSPCR.BIT.GBRP)
            {
                p_regs2->ADSTRGR.BIT.TRSB = trig_b;          // restore TRSB
                p_regs2->ADGCTRGR.BIT.TRSC = trig_c;         // restore TRSC
            }
            else
            {
                if (0 == p_regs2->ADGCTRGR.BIT.GRCE)
                {
                    p_regs2->ADGCTRGR.BIT.TRSC = trig_c;     // restore TRSC
                }
                else
                {
                    p_regs2->ADSTRGR.BIT.TRSB = trig_b;      // restore TRSB
                }
            }
        }
        else
        {
            p_regs2->ADGSPCR.WORD = p_config->priority_groupa;
        }

        /* SET SELF DIAGNOSIS REGISTERS (VIRTUAL CHANNEL) */
        if (ADC_DIAG_OFF == p_config->diag_method)
        {
            p_regs2->ADCER.BIT.DIAGM = 0;
        }
        else
        {

