renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx24u/r_s12ad_rx24u.c
            /* NOTE: Using Self Diagnosis adds 11/13/15(resolution) + (ch0 SST) ADCLKS to scan time. */
            /* (ch0 can still be used with self diagnosis on) */
            if (ADC_DIAG_ROTATE_VOLTS == p_config->diag_method)
            {
                p_regs2->ADCER.BIT.DIAGLD = 0;
                p_regs2->ADCER.BIT.DIAGVAL = 1;
            }
            else
            {
                p_regs2->ADCER.BIT.DIAGLD = 1;

                /* 2-bit value */
                p_regs2->ADCER.BIT.DIAGVAL = (uint8_t)(p_config->diag_method & 0x3);
            }
            p_regs2->ADCER.BIT.DIAGM = 1;
        }

        /* SET DOUBLE TRIGGER CHANNEL */
        if (1 == p_regs2->ADCSR.BIT.DBLE)
        {
            tmp_mask = p_config->chan_mask;         /* tmp_mask is non-Group/Group A chans */

            /* WAIT_LOOP */
            while (tmp_mask >>= 1)                  /* determine bit/ch number @suppress("While statement braces") */
            {
                i++;
            }
            p_regs2->ADCSR.BIT.DBLANS = i;
        }

        /* ENABLE INTERRUPTS */
        adc_enable_s12adi(unit);
        if (ADC_ADCS_GROUP_SCAN == p_regs2->ADCSR.BIT.ADCS)
        {
            adc_enable_s12gbadi(unit);
            if (1 == p_regs2->ADGCTRGR.BIT.GRCE)
            {
                adc_enable_s12gcadi(unit);
            }
        }
    }
    else
    {
        /* SET MASKS FOR CHANNELS */
        p_regs->ADANSA0.WORD = (uint16_t) (p_config->chan_mask & 0x000F);
        p_regs->ADANSA1.WORD = (uint16_t) ((p_config->chan_mask >> 16) & 0x0001);

        /* SET MASKS FOR CHANNELS */
        p_regs->ADANSB0.WORD = (uint16_t) (p_config->chan_mask_groupb & 0x000F);
        p_regs->ADANSB1.WORD = (uint16_t) ((p_config->chan_mask_groupb >> 16) & 0x0001);

        /* SET MASKS FOR CHANNELS */
        p_regs->ADANSC0.WORD = (uint16_t) (p_config->chan_mask_groupc & 0x000F);
        p_regs->ADANSC1.WORD = (uint16_t) ((p_config->chan_mask_groupc >> 16) & 0x0001);

        /* SET MASKS FOR CHANNELS */
        p_regs->ADADS0.WORD = (uint16_t) (p_config->add_mask & 0x000F);
        p_regs->ADADS1.WORD = (uint16_t) ((p_config->add_mask >> 16) & 0x0001);

        adc_configure_sensors(p_config);

        if (1 == unit)
        {
            /* NOTE: S&H adds to scan time because normal state machine still runs. */
            S12AD1.ADSHCR.BIT.SHANS = p_config->sample_hold_mask;

            /* adds 12 + sample_hold_states ADCLKS to scan time */
            S12AD1.ADSHCR.BIT.SSTSH = p_config->sample_hold_states;
        }

        /* Programmable Gain Amplifier setting */
        tmp_adpgacr = 0x9999;
        tmp_adpgacr |= p_config->pga_amp[0];
        if (1 == unit)
        {
            tmp_adpgacr |= (p_config->pga_amp[1] << 4);
            tmp_adpgacr |= (p_config->pga_amp[2] << 8);
        }
        p_regs->ADPGACR.WORD = tmp_adpgacr;

        /* Operation stabilization wait time(5us) */
        R_BSP_SoftwareDelay((uint32_t)(5+1), BSP_DELAY_MICROSECS);

        tmp_adpgags0 = 0x0000;
        tmp_adpgags0 |= (p_config->pga_gain[0]);
        if (1 == unit)
        {
            tmp_adpgags0 |= (p_config->pga_gain[1] << 4);
            tmp_adpgags0 |= (p_config->pga_gain[2] << 8);
        }
        p_regs->ADPGAGS0.WORD = tmp_adpgags0;

        /* SET GROUP A PRIORITY ACTION (not interrupt priority!) */

        if (ADC_GRPA_PRIORITY_OFF != p_config->priority_groupa)
        {
            trig_a = p_regs->ADSTRGR.BIT.TRSA;              // save TRSA
            trig_b = p_regs->ADSTRGR.BIT.TRSB;              // save TRSB
            trig_c = p_regs->ADGCTRGR.BIT.TRSC;             // save TRSC
            p_regs->ADSTRGR.BIT.TRSA = ADC_TRIG_NONE;
            p_regs->ADSTRGR.BIT.TRSB = ADC_TRIG_NONE;
            p_regs->ADGCTRGR.BIT.TRSC = ADC_TRIG_NONE;
            if (ADC_TRIG_NONE != p_regs->ADSTRGR.BIT.TRSA)  // bus wait for ADSTRGR write
            {
                R_BSP_NOP();
            }
            if (ADC_TRIG_NONE != p_regs->ADSTRGR.BIT.TRSB)  // bus wait for ADSTRGR write
            {
                R_BSP_NOP();
            }
            if (ADC_TRIG_NONE != p_regs->ADGCTRGR.BIT.TRSC) // bus wait for ADGCTRGR write
            {
                R_BSP_NOP();
            }

            p_regs->ADGSPCR.WORD = p_config->priority_groupa;

            p_regs->ADSTRGR.BIT.TRSA = trig_a;              // restore TRSA

            if (0 == p_regs->ADGSPCR.BIT.GBRP)
            {
                p_regs->ADSTRGR.BIT.TRSB = trig_b;   // restore TRSB
                p_regs->ADGCTRGR.BIT.TRSC = trig_c;  // restore TRSC
            }
            else
            {
                if (0 == p_regs->ADGCTRGR.BIT.GRCE)
                {
                    p_regs->ADGCTRGR.BIT.TRSC = trig_c;  // restore TRSC
                }
                else
                {
                    p_regs->ADSTRGR.BIT.TRSB = trig_b;   // restore TRSB
                }
            }
        }
        else
        {
            p_regs->ADGSPCR.WORD = p_config->priority_groupa;
        }

        /* SET SELF DIAGNOSIS REGISTERS (VIRTUAL CHANNEL) */
        if (ADC_DIAG_OFF == p_config->diag_method)
        {
            p_regs->ADCER.BIT.DIAGM = 0;
        }
        else
        {

            /* NOTE: Using Self Diagnosis adds 11/13/15(resolution) + (ch0 SST) ADCLKS to scan time. */
            /* (ch0 can still be used with self diagnosis on) */
            if (ADC_DIAG_ROTATE_VOLTS == p_config->diag_method)
            {
                p_regs->ADCER.BIT.DIAGLD = 0;
                p_regs->ADCER.BIT.DIAGVAL = 1;
            }
            else
            {
                p_regs->ADCER.BIT.DIAGLD = 1;

                /* 2-bit value */
                p_regs->ADCER.BIT.DIAGVAL = (uint8_t)(p_config->diag_method & 0x3);
            }
            p_regs->ADCER.BIT.DIAGM = 1;
        }

        /* SET DOUBLE TRIGGER CHANNEL */
        if (1 == p_regs->ADCSR.BIT.DBLE)
        {
            tmp_mask = p_config->chan_mask;         /* tmp_mask is non-Group/Group A chans */

            /* WAIT_LOOP */
            while (tmp_mask >>= 1)                  /* determine bit/ch number @suppress("While statement braces") */
            {
                i++;
            }
            p_regs->ADCSR.BIT.DBLANS = i;
        }

        /* ENABLE INTERRUPTS */
        adc_enable_s12adi(unit);
        if (ADC_ADCS_GROUP_SCAN == p_regs->ADCSR.BIT.ADCS)
        {
            adc_enable_s12gbadi(unit);
            if (1 == p_regs->ADGCTRGR.BIT.GRCE)
            {
                adc_enable_s12gcadi(unit);
            }
        }
    }

