renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx24u/r_s12ad_rx24u.c
/******************************************************************************
* Function Name: adc_enable_s12gcadi
* Description  : This function clears the S12GCADI interrupt flag and enables
*                interrupts in the peripheral (for IR flag usage). If priority
*                is not 0, interrupts are enabled in the ICU.
*                NOTE: This has nothing to do with enabling triggers.
* Arguments    : unit -
*                   0
* Return Value : none
*******************************************************************************/
static void adc_enable_s12gcadi(uint8_t unit)
{
    if (0 == unit)
    {
        IR(S12AD,GCADI) = 0;                // clear flag
        S12AD.ADGCTRGR.BIT.GCADIE = 1;      // enable in peripheral
        if (0 != IPR(S12AD,GCADI))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD,GCADI));         // enable in ICU
        }
    }
    else if (1 == unit) /* Unit1 */
    {
        IR(S12AD1,GCADI1) = 0;              // clear flag
        S12AD1.ADGCTRGR.BIT.GCADIE = 1;     // enable in peripheral
        if (0 != IPR(S12AD1,GCADI1))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD1,GCADI1));       // enable in ICU
        }
    }
    else /* Unit2 */
    {
        IR(S12AD2,GCADI2) = 0;              // clear flag
        S12AD2.ADGCTRGR.BIT.GCADIE = 1;     // enable in peripheral
        if (0 != IPR(S12AD2,GCADI2))
        {
            R_BSP_InterruptRequestEnable(VECT(S12AD2,GCADI2));       // enable in ICU
        }
    }
} /* End of function adc_enable_s12gcadi() */


/******************************************************************************
* Function Name: adc_close
* Description  : This is implementation of R_ADC_Close().
*                This function ends any scan in progress, disables interrupts,
*                and removes power to the A/D peripheral.
* Arguments    : none
* Return Value : ADC_SUCCESS - Successful
*                ADC_ERR_INVALID_ARG - unit contains an invalid value.
*******************************************************************************/
adc_err_t adc_close(uint8_t const  unit)
{
    aregs_t      *p_regs;
    aregs2_t     *p_regs2;
    volatile    uint8_t i;

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif

    /* A/D register address */
    if (0 == unit)
    {
        p_regs = (aregs_t *)&S12AD;
    }
    else if (1 == unit)
    {
        p_regs = (aregs_t *)&S12AD1;
    }
    else
    {
        p_regs2 = (aregs2_t *)&S12AD2;
    }

#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
    if (unit > 2)
    {
        return ADC_ERR_INVALID_ARG;
    }
#endif

    /* Stop triggers & conversions, and disable peripheral interrupts */
    if (0 == unit)
    {
        R_BSP_InterruptRequestDisable(VECT(S12AD,S12ADI));      // disable interrupts in ICU
        R_BSP_InterruptRequestDisable(VECT(S12AD,GBADI));       // disable interrupts in ICU
        R_BSP_InterruptRequestDisable(VECT(S12AD,GCADI));       // disable interrupts in ICU

        IPR(S12AD,S12ADI) = 0;
        IPR(S12AD,GBADI) = 0;
        IPR(S12AD,GCADI) = 0;
    }
    else if (1 == unit) /* Unit1 */
    {
        R_BSP_InterruptRequestDisable(VECT(S12AD1,S12ADI1));    // disable interrupts in ICU
        R_BSP_InterruptRequestDisable(VECT(S12AD1,GBADI1));     // disable interrupts in ICU
        R_BSP_InterruptRequestDisable(VECT(S12AD1,GCADI1));     // disable interrupts in ICU

        IPR(S12AD1,S12ADI1) = 0;
        IPR(S12AD1,GBADI1) = 0;
        IPR(S12AD1,GCADI1) = 0;
    }
    else /* Unit2 */
    {
        R_BSP_InterruptRequestDisable(VECT(S12AD2,S12ADI2));    // disable interrupts in ICU
        R_BSP_InterruptRequestDisable(VECT(S12AD2,GBADI2));     // disable interrupts in ICU
        R_BSP_InterruptRequestDisable(VECT(S12AD2,GCADI2));     // disable interrupts in ICU

        IPR(S12AD2,S12ADI2) = 0;
        IPR(S12AD2,GBADI2) = 0;
        IPR(S12AD2,GCADI2) = 0;
    }

    if (2 == unit)
    {
        if (1 == p_regs2->ADGSPCR.BIT.PGS)
        {
            p_regs2->ADGSPCR.BIT.PGS = 0;
        }

        if (ADC_ADCS_GROUP_SCAN == p_regs2->ADCSR.BIT.ADCS)
        {
            p_regs2->ADSTRGR.WORD = 0x3F3F;
            if (1 == p_regs2->ADGCTRGR.BIT.GRCE)
            {
                p_regs2->ADGCTRGR.BIT.TRSC = 0x3F;
                p_regs2->ADGCTRGR.BIT.GCADIE = 0;
            }
        }
        else
        {
            p_regs2->ADSTRGR.BIT.TRSA = 0x3F;
        }

        p_regs2->ADCSR.WORD = 0;
        if (0 != p_regs2->ADCSR.WORD)
        {

            /* Dommy read and compare */
            R_BSP_NOP();
        }
    }
    else
    {
        if (1 == p_regs->ADGSPCR.BIT.PGS)
        {
            p_regs->ADGSPCR.BIT.PGS = 0;
        }

        if (ADC_ADCS_GROUP_SCAN == p_regs->ADCSR.BIT.ADCS)
        {
            p_regs->ADSTRGR.WORD = 0x3F3F;
            if (1 == p_regs->ADGCTRGR.BIT.GRCE)
            {
                p_regs->ADGCTRGR.BIT.TRSC = 0x3F;
                p_regs->ADGCTRGR.BIT.GCADIE = 0;
            }
        }
        else
        {
            p_regs->ADSTRGR.BIT.TRSA = 0x3F;
        }

        p_regs->ADCSR.WORD = 0;
        if (0 != p_regs->ADCSR.WORD)
        {

            /* Dommy read and compare */
            R_BSP_NOP();
        }
    }

    /* Wait for three clock cycles of ADCLK before entering the module stop mode */
    /* WAIT_LOOP */
    for (i = 0; i < 192; i++)
    {
        R_BSP_NOP();
    }

    if (0 == unit)
    {
        IR(S12AD,S12ADI) = 0;         // clear interrupt flag
        IR(S12AD,GBADI) = 0;          // clear interrupt flag
        IR(S12AD,GCADI) = 0;          // clear interrupt flag
    }
    else if (1 == unit) /* Unit1 */
    {
        IR(S12AD1,S12ADI1) = 0;       // clear interrupt flag
        IR(S12AD1,GBADI1) = 0;        // clear interrupt flag
        IR(S12AD1,GCADI1) = 0;        // clear interrupt flag
    }
    else /* Unit2 */
    {
        IR(S12AD2,S12ADI2) = 0;       // clear interrupt flag
        IR(S12AD2,GBADI2) = 0;        // clear interrupt flag
        IR(S12AD2,GCADI2) = 0;        // clear interrupt flag
    }

    /* Power down peripheral */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif
    /* S12A module clock is enabled */
    if (0 == unit)
    {
        MSTP(S12AD) = 1;
    }
    else if (1 == unit)
    {
        MSTP(S12AD1) = 1;
    }
    else
    {
        MSTP(S12AD2) = 1;
    }
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif

